Repository: nekohepott32/NekoTune
Catalog: locales/*/LC_MESSAGES/bot.po
Languages: ru

source: Language set successfully!
ru: Язык изменён!

source: *Hello!👋 Send me the name of a song, and I'll start searching for it!*Help command: /help.
ru: *Привет!👋 Отправь мне название песни, и я начну её искать!* Помощь бо боту - /help.

source: *About bot:* • This bot can search and download music from *YouTube Music*! • Bot saves downloaded tracks — if track already exist in downloads, bot will send file *instantly*! • All downloaded tracks available in [this channel](https://t.me/nekotune_db). • Absolutely free and without ad, *no need to subscribe to any channels*! *Available commands:* • /start — Start using bot. • /help — Show this message with hints. • /setlang — Change language. *How to use:* 1. Send song name to start searching. 2. Choose track you need from list. 3. Get ready MP3 file with album cover! *Hints:* • Make sure that entered song name is correct. • If song name is foreign language (like Japanese), its likely to write in that language. • If you cant see your track in list, try to narrow your search! Example: for track Animal - Deco27 write not only "Animal", but "Animal Deco". • If you run into problem, try again or DM me! [CLICK](https://t.me/nekohepott).
ru: *О боте:* • Этот бот может искать и загружать музыку с *YouTube Music*! • Бот сохраняет загруженные треки — если трек есть в загруженных, бот отправит файл *моментально*! • Все загруженные треки есть в [этом канале](https://t.me/nekotune_db). • Абсолютно бесплатно и без рекламы, *не надо подписываться ни на какие каналы*! *Доступные команды:* • /start — Начать использовать бота. • /help — Показать это сообщение с подсказками. • /setlang — Сменить язык. *Как использовать:* 1. Отправь название песни, чтобы начать поиск. 2. Выбери нужный трек из списка. 3. Получи готовый MP3 файл с обложкой! *Советы:* • Убедись, что введённое название корректно. • Если название трека на другом языке (например, японском), желательно писать название на этом же языке. • Если вы не видите своего трека в списке, попробуйте сократить круг поиска! Пример: для трека Animal - Deco27 напишите не просто "Animal", а "Animal Deco". • Если столкнулся с проблемами, попробуй снова или напиши мне! [КЛИК](https://t.me/nekohepott).

source: ❌ There was an error while sending hint message. Try again later.
ru: ❌ Произошла ошибка при отправке подсказки. Попробуйте позже.

source: ❌ Sadly, I couldn`t find track with query: *{query}*.
ru: ❌ К сожалению, я не смог найти трек по запросу: *{query}*.

source: 🔍*Search:* _{query}_ ⬇️*Choose track:*
ru: 🔍*Поиск:* _{query}_ ⬇️*Выбери трек:*

source: ❗Error: data empty.
ru: ❗Ошибка: данные отсутствуют.

source: Track not found.
ru: Трек не найден.

source: 🔄 _{track_name}_ - *Downloading... I changed bot server, tracks downloading takes more time, wait...*
ru: 🔄 _{track_name}_ - *Загружается... Я перевёл бота на другой сервер, треки загружаются намного дольше, ждите...*

source: ❗ There was an error while downloading: {e}
ru: ❗ Произошла проблема при загрузке: {e}

source: ⚠️ Track name was cut due to file system limits.
ru: ⚠️ Название трека было укорочено из-за ограничений длины файловой системы.

source: ❗ There was an error: timeout. Try again later.
ru: ❗ Произошла ошибка: время ожидания истекло. Попробуйте снова позже.

source: ❗ There was an error: {e}
ru: ❗ Произошла ошибка: {e}

source: ⏪Previous
ru: ⏪Назад

source: Next⏩
ru: Дальше⏩
