Repository: nekohepott32/NekoTune
Catalog: locales/ua/LC_MESSAGES/bot.po
Languages: uk

source: Language set successfully!
uk: Мову змінено!

source: *Hello!👋 Send me the name of a song, and I'll start searching for it!*Help command: /help.
uk: *Привіт!👋 Відправ мені назву пісні, і я почну її шукати!* Допомога з ботом - /help.

source: *About bot:* • This bot can search and download music from *YouTube Music*! • Bot saves downloaded tracks — if track already exist in downloads, bot will send file *instantly*! • All downloaded tracks available in [this channel](https://t.me/nekotune_db). • Absolutely free and without ad, *no need to subscribe to any channels*! *Available commands:* • /start — Start using bot. • /help — Show this message with hints. • /setlang — Change language. *How to use:* 1. Send song name to start searching. 2. Choose track you need from list. 3. Get ready MP3 file with album cover! *Hints:* • Make sure that entered song name is correct. • If song name is foreign language (like Japanese), its likely to write in that language. • If you cant see your track in list, try to narrow your search! Example: for track Animal - Deco27 write not only "Animal", but "Animal Deco". • If you run into problem, try again or DM me! [CLICK](https://t.me/nekohepott).
uk: *Про бота:* • Цей бот може шукати та завантажувати треки з *YouTube Music*! • Бот зберігає завантажені треки — якщо трек вже є у завантажених, бот відправить файл *миттєво*! • Усі завантажені треки є у [цьому каналі](https://t.me/nekotune_db). • Абсолютно безкоштовно та без реклами, *не треба підписуватись на ніякі канали*! *Наявні команди:* • /start — Почати використовувати бота. • /help — Показати це повідомлення з підказками. • /setlang — Змінити мову. *Як використовувати:* 1. Відправ назву пісні, щоб почати пошук. 2. Вибери потрібний трек зі списку. 3. Отримай готовий MP3 файл з обкладинкою! *Поради:* • Переконайся, що введена назва коректна. • Якщо назва треку іншою мовою (наприклад, японською), бажано писати назву цією ж мовою. • Якщо ви не бачите свого трека у списку, спробуйте скоротити коло пошуку! Приклад: для треку Animal - Deco27 напишіть не просто "Animal", а "Animal Deco". • Якщо зіткнувся з проблемами, спробуй знову або напиши мені! [КЛІК](https://t.me/nekohepott).

source: ❌ There was an error while sending hint message. Try again later.
uk: ❌ Виникла помилка при відправці підсказки. Спробуйте пізніше.

source: ❌ Sadly, I couldn`t find track with query: *{query}*.
uk: ❌ Нажаль, я не зміг найти трек за запитом: *{query}*

source: 🔍*Search:* _{query}_ ⬇️*Choose track:*
uk: 🔍*Пошук:* _{query}_ ⬇️*Вибери трек:*

source: ❗Error: data empty.
uk: ❗Помилка: дані відсутні.

source: Track not found.
uk: ❗Помилка: дані відсутні.

source: 🔄 _{track_name}_ - *Downloading... I changed bot server, tracks downloading takes more time, wait...*
uk: 🔄 _{track_name}_ - *Завантажується.. Я змінив сервер бота, треки завантажуються набагато довше, очікуйте...*

source: ❗ There was an error while downloading: {e}
uk: ❗ Виникла проблема при завантажуванні: {e}

source: ⚠️ Track name was cut due to file system limits.
uk: ⚠️ Назву треку було скорочено через обмеження файлової системи.

source: ❗ There was an error: timeout. Try again later.
uk: ❗ Виникла помилка: час очікування вичерпано. Спробуйте знову пізніше.

source: ❗ There was an error: {e}
uk: ❗ Виникла помилка: {e}

source: ⏪Previous
uk: ⏪Назад

source: Next⏩
uk: Далі⏩
